[
  {
    "url": "https://uk.linkedin.com/jobs/view/product-manager-at-explore-group-3762617690?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=0sHF9u35B8CYbDGTocqpUg%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Product Manager",
    "description": "Product Manager - £75,000 + Benefits – Remote – Internal Platforms / SystemsExplore Group is working for a very reputable brand within the Healthcare space who have be operating within the United Kingdom. Since the company’s establishment, they have grown substantially and now have around 60 branches across the nation. Due to this growth, they have now begun building a brand-new agile tech team with the aim to develop new platforms/systems and work on their existing products.As the business continues to develop and evolve, they are now a real need for an experienced Product Manager to come on board who has historically worked on internal systems to help drive a new HR solution.The role:2 years+ experience working within product management.Product roadmap, strategy and vision definition.Able to show commercial experience collaborating with engineering & UX / UI teams.Must have experience building internal products (CRM, HR, Supply Chain etc).0-1 experience (ideation to launch).If you would like to be considered for this position, then please apply according to this post or send your CV directly to lewis.dorling@exploreltd.com.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/communications-consultant-at-explore-group-3759784634?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=v93ELIrFIGBvum3VnFoiIQ%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Communications Consultant",
    "description": "Communications Consultant - Remote within the EU - 1 year contract We're currently partnered with one of the worlds leading consultancies, who are looking for an experienced Communications Consultant to join the team on a freelance basis.Fully remote within the EU (must have full rights to work in the EU)12 month contractExperience with public relations and a range of communication strategiesMust be fluent in English (at least B2)Stakeholder management skillsExperience with Jira and Confluence At least 3 years experience in the communications spaceIf this role is of interest, apply here.Communications Consultant - Remote within the EU - 1 year contract\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/help-desk-analyst-at-explore-group-3760863498?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=uW4hwtUja7hiV3sOhFIv2w%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Help Desk Analyst",
    "description": "I am currently partnered with a leading HealthTech Business who are looking for a Helpdesk Analyst / IT administrator to join their team for a 6 month rolling contract. This is a fully remote role and they are looking for someone to start ASAP, they will wait for a notice for the right candidate.Tech Stack: Office365 suite including Exchange Teams and SharePointEnd user hardware support (Windows 10/11, iOS, Android)Azure AD administration ITIL Any experience with MacOS will add weight to an application.If this is of interest please apply or send your CV to charlie.nagel@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/python-developer-at-explore-group-3763153536?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=vcE1UuxnOko2ylo0y1d1vg%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Python Developer",
    "description": "🚀 Exciting Python Developer Opportunity🚀 Contract, Outside IR35, Fully Remote (UK Only)Are you a passionate Python Developer seeking your next challenging project? Look no further! We are actively seeking a skilled Python Developer for an exciting contract opportunity, working outside IR35, with a competitive daily rate of £600+.Key Details:Role: Python Developer (Contract)IR35 Status: Outside IR35Location: Fully Remote (UK Only)Daily Rate: 600+Responsibilities:As a Python Developer, you will be instrumental in crafting innovative solutions using your expertise in either Django or Fast-API within the Python ecosystem. You will play a pivotal role in designing, implementing, and maintaining cutting-edge applications.Requirements:Proven experience as a Python DeveloperExpertise in either Django or Fast-APIStrong understanding of web development principlesAbility to work independently and collaboratively in a remote environmentUK-based candidates onlyBenefits:Competitive daily rate (600+)Fully remote work, providing you the flexibility to work from the comfort of your own spaceEngage in a challenging and rewarding project that will enhance your skill setJoin a dynamic team of professionals passionate about technology and innovationHow to Apply:If you are a talented Python Developer ready to take on a new challenge, we want to hear from you! Please submit your CV along with a brief cover letter highlighting your relevant experience to max.murray@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-business-analyst-at-explore-group-3760855430?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=RzCnXD%2FrxXYeel5h0QvjDQ%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Business Analyst",
    "description": "🌟 Exciting Opportunity for Senior IT Business Analyst - Fully Remote 🌟Position: Senior IT Business AnalystLocation: 🌍 Fully Remote (Anywhere in Europe)Contract Duration: 12 MonthsRate: €40+ per hourAre you a seasoned IT Business Analyst with a passion for driving impactful projects? We are seeking a talented individual to join our team on a fully remote basis, providing you the flexibility to work from anywhere in Europe!🔸 Collaborate with stakeholders to gather and analyze business requirements🔸 Conduct in-depth data analysis and propose effective solutions🔸 Translate business needs into technical requirements🔸 Drive communication between technical and non-technical teams🔸 Work closely with project managers to ensure successful project deliveryRequirements:✅ Proven experience as a Senior IT Business Analyst✅ Strong analytical and problem-solving skills✅ Excellent communication and interpersonal abilities✅ Experience in gathering and documenting detailed requirements✅ Ability to work independently and remotelyBenefits:💻 Fully Remote: Enjoy the freedom to work from the comfort of your chosen location in Europe.💼 Competitive Compensation: Earn a competitive rate of €40+ per hour.📆 Immediate Start: Be part of the team and start making an impact right away.🔄 12-Month Contract: Secure your spot for a year-long engagement with the potential for extension.Application Process:If you are ready to take on a challenging and rewarding role as a Senior IT Business Analyst, we want to hear from you! Interviews are scheduled to begin early next week.Don't miss the chance to be a key player in driving IT excellence! 🚀✨\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/javascript-developer-at-explore-group-3757272896?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=XyGM7XH6XUYtMnlyJ42VKQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Javascript Developer",
    "description": "Senior Software Engineer (Node, React, Javascript, SQL£60K-£80K Fully remote, must be UK based. Office based in Sheffield The Explore Group have partnered up with a leading B2B SaaS scale up business based in the south of Yorkshire that are looking to expand their UK software engineering team as they launch 2 new products next year. We are looking for a Node/React Developer to join a team of collaborative engineers .Skills:Node, React, JavascriptAWS or AzureSQL and Stored Procedures Good communication skillsWhat's on offer:Salary between £60k to £80k depending on experienceSalary reviewsFully remote work (open to UK candidates only)Pensions25 days holiday (+ additional for public holidays)Home office set up Healthcare and insuranceFlexible working hours 2 stage interview process:1) initial call2) technical interviewIf you're interested, please apply to this advert or email iqbal.miah@exploreltd.com React / Node / JavaScript / Typescript / Node / HTML / CSS / Developer / Frontend / Front end / Front-end / Software engineer / SQL / Full stack Developer/ Contract / London / UK / United Kingdom / Scotland / Wales / Glasgow / Edinburgh / Birmingham / Manchester / SQL / Sheffield / Nottingham / Coventry / Doncaster / Yorkshire / Azure / AWS\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/product-owner-at-explore-group-3753033346?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=ARw2con2ED4sD1iLXGEvRw%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Product Owner",
    "description": "Product Owner - Customer Engagement/ Software Development (6-Month Contract)Location: SpainSalary: $350+ per dayAre you a highly skilled Product Owner with a proven track record in the field and a passion for customer engagement and software development? Do you have extensive experience with agile methodologies, particularly Scrum, and the proficiency to navigate project management tools like Jira? Are you familiar with Sprinklr and PowerBi, and do you have a deep understanding of the insurance industry? If so, we have an exciting opportunity for you!You will play a critical role in shaping and delivering innovative solutions that drive customer engagement and success. This is a 6-month initial contract position with the potential for extension, offering competitive daily compensation of $350+.Product Ownership: Collaborate with cross-functional teams to define, prioritize, and manage the product backlog. Take ownership of the product vision, ensuring alignment with customer engagement and software development goals.Agile Expertise: Apply agile methodologies, particularly Scrum, to drive product development. Lead sprint planning, daily stand-ups, and sprint reviews to ensure efficient project delivery.Project Management: Utilize project management tools like Jira to track progress, manage tasks, and facilitate communication among team members.Data Insights: Leverage your knowledge of PowerBi to analyze data, gain valuable insights, and make data-driven decisions to improve the product.Industry Expertise: Apply your deep understanding of the insurance industry to tailor products and solutions to specific customer needs and industry requirements.Stakeholder Collaboration: Collaborate with various stakeholders, including developers, designers, and business analysts, to ensure clear communication and alignment on project objectives.A minimum of 5 years of experience as a Product Owner or in a similar role within the customer engagement or software development industry.Proficiency in agile development methodologies, specifically Scrum.Demonstrated experience with project management tools, such as Jira.Familiarity with Sprinklr and PowerBi is highly preferred.In-depth knowledge of the insurance industry.Strong communication, problem-solving, and leadership skills.Ability to work collaboratively in a cross-functional team environment.Proven track record of delivering successful product outcomes.If you are a results-driven Product Owner with the skills and experience we are looking for, we encourage you to apply for this exciting opportunity. Join us in shaping the future of customer engagement in the insurance industry\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://lu.linkedin.com/jobs/view/junior-technical-administrator-at-explore-group-3764196466?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=271d05U2nCHwmtEGNlKp0Q%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Junior Technical Administrator",
    "description": "🚀 Junior Technical Administrator Opportunity! 🚀🌟Are you flexible to go into the office? 🌟OPEN TO RELOCATE TO LUXEMBOURG🌟🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP 🌟Are you an experienced Junior Technical Administrator looking for a new opportunity to start ASAP, We have an exciting opportunity for you to join the team and we're ready for you to start immediately.✅EXPERIENCE IN - VMWARE ✅ EXPERIENCE IN - HP SERVERS ( PROLIANT G9-G10)✅ EXPERIENCE IN - IBM SERVERS 🌟Are you flexible to go into the office? 🌟OPEN TO RELOCATE TO LUXEMBOURG🌟🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP 🌐 What's in It for You:💲 Competitive Compensation:you will be working 40 hours a week, as you embrace your role and make a significant impact on our gaming app.🏁 Immediate Start: Jump into action from day one, taking on a pivotal role in our team's success.🌐 Apply now or send your CV to Libby.Ince@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Voir plus\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Voir moins"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/back-end-developer-at-explore-group-3759306088?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=8ReV9eKOlUyMrlcJKcV3AQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Back End Developer",
    "description": "Backend (Rust) Developer - Salary Up To £55,000 - Remote (Europe)Overview:Are you a skilled and enthusiastic Rust developer who likes to take on a new challenge? Do you thrive in a dynamic and collaborative environment? We have a fantastic opportunity for you to join our innovative team on a contract basis, working remotely from anywhere in Europe!Responsibilities:Collaborate with cross-functional teams to design, develop, and implement Rust-based applications and solutions.Write clean, efficient, and well-documented code to meet project requirements.Participate in code reviews, debugging, and troubleshooting to ensure optimal performance and maintainability.Requirements:You must have minimum 1-2 years of commercial experience coding in RustAs well as be proficient in at least one of the following languages: JavaScript, Python, C#, C++.Experience in relational databases designIf you think this contract is a great fit for you then do not hesitate and apply now! If you have any enquiries please email me at Zeqir.repaj@exploreltd.comBackend (Rust) Developer - Salary Up To £55,000 - Remote (Europe)\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/full-stack-engineer-at-explore-group-3764123125?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=53DdIqyPe4cd1qUfLB%2FiDw%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Engineer",
    "description": "Remote Full Stack Developer (React/TypeScript/Next.js/Nest) 🚀Location: Remote (UK or EU-based applicants welcome) 🌐Contract Type: 3-month rolling contract ⏳Rate: £400 per day (outside IR35) / €400 per day 💸About Us:We are a dynamic and innovative digital solutions provider specializing in the health tech space. Our team is passionate about leveraging cutting-edge technologies to create impactful solutions that enhance healthcare delivery and improve patient outcomes. 🏥💡We are seeking a skilled Full Stack Developer with expertise in React, TypeScript, Next.js, and Nest to join our remote team. As a key member of our development team, you will play a crucial role in building and enhancing digital solutions for health tech projects. 🛠️💻Key Responsibilities:Collaborate with cross-functional teams to design, develop, and deploy high-quality software solutions.Utilize React, TypeScript, Next.js, and Nest to build scalable and efficient applications.Contribute to the entire software development lifecycle, from concept to deployment.Ensure code quality, performance, and security best practices. 🔐🚀Qualifications and Skills:Proven experience as a Full Stack Developer with expertise in React, TypeScript, Next.js, and Nest.Strong understanding of front-end and back-end technologies.Experience working on projects within the health tech sector is a plus.Excellent problem-solving and communication skills. 🤝💡Contract Terms:3-month rolling contract.Remote work, with flexibility for UK or EU-based candidates.Competitive daily rate of £400 (outside IR35) / €400. 💼💰How to Apply:Don't miss out on this exciting opportunity to contribute to innovative health tech projects. Apply below...Join us in making a positive impact in the health tech space! 🌟🚀✨\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/software-engineer-at-explore-group-3762823260?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=obgsZEKG2NQ1sUHbhds90g%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Software Engineer",
    "description": "🚀Software Engineer Opportunity! 🚀🌟12 Month Contract 🌟NEEDS TO BE WITHIN THE US🌟( 40 hours a week )🌟🌟 FULLY REMOTE 🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP  Would prefer the candidate Portland or Wilsonville Are you an experienced Software Engineer looking for a new contract to start ASAP, We have an exciting opportunity for you to join the team and we're ready for you to start immediately.✅EXPERIENCE IN - C++ OR JAVA✅ EXPERIENCE IN - SOFTWARE DEVELOPMENT(IDE,ECLIPSE,QT CREATOR)✅ EXPERIENCE IN - API, UX DESIGN🌟12 Month Contract 🌟NEEDS TO BE WITHIN THE US🌟( 40 hours a week )🌟🌟 FULLY REMOTE 🌟STARTING ASAP🌟WE'RE NOT EXCEPTING ANY SUPPORT FROM EXTERNAL AGENCIES, ANY EMAILS WILL BE TREATED AS SPAM!🌐 What's in It for You:💼 12 Month Rolling Contract: Enjoy the flexibility of a rolling contract, allowing you to focus on challenging your skill set with this long term commitment.💲 Competitive Compensation:you will be working 40 hours a week, as you embrace your role and make a significant impact on our gaming app.🏁 Immediate Start: Jump into action from day one, taking on a pivotal role in our team's success.🌐 Apply now or send your CV to Libby.Ince@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/full-stack-engineer-at-explore-group-3763554555?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=QvPItChpL7MBJeP6Pos1yw%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Engineer",
    "description": "Full Stack Developer - Fully remote - Contract OUTSIDE IR35My client is a dynamic and innovative digital health technology company that strives to craft and scale their health tech software globallyThey are a team of dedicated professionals with a strong focus on collaboration, and continuous improvement. They are actively searching for an experienced Full stack Developer who is ready for a new adventure.Qualifications :Proficiency in JavaScript (TypeScript, React, Node.js, and functional programming).Knowledge of AWS and/or Azure (certifications are a bonus).Good testing principles for unit, integration and e2e.The role:Fully remote2 stage interview processStart ASAPPlease of any interest reach out to me directly via email ajay.patel@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/full-stack-developer-at-explore-group-3763572708?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=jGaStKS2xwIg47vG8C0vAA%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Developer",
    "description": "🌟3+ MONTHS CONTRACT🌟FULLY REMOTE🌟OUTSIDE IR35Are you a Full stack developer looking for a brand-new freelance role? we're currently partnered with a leading consultancy who are starting an new exciting project, who are looking for an full stack developer to come and join their team on an exciting new freelance role.✅EXPERIENCE WITH REACT, TYPESCRIPT✅EXPERIENCE WITH NODE.JS/ NEXT.JS✅ EXPERIENCE WITH AWS CLOUD🌟3+ MONTH CONTRACT 🌟FULLY REMOTE🌟OUTSIDE IR35🌐 What's in It for You:💼 3+ months contract🏁 Interviews ASAP! 🌐 Apply now or send your CV to Liberty.dunne@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/agile-coach-at-explore-group-3763150375?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=5jk4It2ZqfWd0FInnTdRVQ%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Agile Coach",
    "description": "INCREDIBLE CAREER OPPORTUNITY AT ONE OF THE WORLD'S LARGEST INSURANCE ORGANISATIONS FOR AN EXPERIENCED AGILE COACH! Experienced coach to help transition the client existing work practices to a full embrace of agile methodology, from the top down. The agile coach will mentor and guide our employees in how to figure out the best solutions for their specific departmental challenges.Responsibilities Guide teams in how to stay on track with agile techniques, fine-tuning their approach to ensure that overall strategy is being met.Lead agile workshops for developer and functional teams, as well as for key stakeholders.Promote a culture of continuous improvement, setting goals and milestones and assigning responsibility. Perks of the job€400/dayFully Remote!!English required6-12 Month ContractMulti-Year Project!!!Clear path of progression and growth!Expert level teammates to upskill your experience and gain knowledge fromFriendly and collaborative culturePlease contact me on miles.girling@exploreltd.com asap to discuss more!!\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/software-engineer-at-explore-group-3762803017?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=hkhuIaG0vNxGuutQg1SAMA%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Software Engineer",
    "description": "Software Developer - Remote within the US - 12 month contractWe're partnered with a leading, global consultancy who are looking for a number of Software engineers to join the team on a 12 month contract role. Qualifications:3+ years of experience as a Software Developer.Proficiency in C++ and/or JavaFamiliarity with integrated development environments (IDE's)Experience with the full software development lifecycle.Experience with GITImmediate availability for a 12-month contract.Nice to have:Experience with REST APIsExperience with QT frameworkFamiliarity with MSI InstallersThis is a fully remote position, providing the flexibility to work from anywhere in the USIf this role is of interest, apply here. Please note, no external agency support any emails will be treated as spam.Software Developer - Remote within the US - 12 month contract\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/machine-learning-engineer-at-explore-group-3758430641?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=5brsNA6qArJaYND3REB6lw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Machine Learning Engineer",
    "description": "Machine Learning ArchitectFully Remote Rate: Up to €320 p/d Explore Group have partnered up with a trusted global consultancy who are looking for a Machine Learning Architect to join them on a project working with their end client who is an established insurance company. Role Overview: As a Machine Learning Architect, you will play a crucial role in designing and architecting innovative machine learning solutions for our multinational insurance client. You will be responsible for creating scalable, secure, and efficient machine learning models and pipelines.Responsibilities: Machine Learning Architecture: Design end-to-end machine learning solutions and systems that address complex business problems.MLOps Expertise: Develop and maintain MLOps pipelines to ensure the seamless deployment and monitoring of machine learning models.Programming and Tool Proficiency: Utilise relevant programming languages, tools, and frameworks commonly used in model development and MLOps, such as Python, Docker, and Kubernetes.Cloud Computing: Utilise cloud computing platforms (e.g., AWS, Azure, GCP) and have experience with their services related to machine learning and deployment.Scalability: Architect and design scalable and secure platforms that can handle large volumes of data and adapt to changing business needs.Requirements: A minimum of 4 years of experience in an AI/ML/Data Science role, with a strong background in MLOps.Proficiency in programming languages commonly used in machine learning, such as Python, and experience with containerization tools like Docker and orchestration tools like Kubernetes.Strong knowledge of cloud computing platforms, including AWS, Azure, or GCP, and hands-on experience with their machine learning-related services.Proven experience in architecting and designing scalable and secure platforms, with a focus on data and model security.Excellent problem-solving and communication skills, as you will work closely with both technical and non-technical stakeholders.\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/software-engineer-at-explore-group-3762401223?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=1qZeV%2F5BKTrFyLexB9qe%2FA%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Software Engineer",
    "description": "Software Engineer-Fully Remote-£70k to £90k DOEMy client are revolutionising the music tech industry and are currently looking for an experienced Software Engineer using Golang to join their expanding team at a key point in the journey of scaling up.Responsibilities:Design, develop, test, and maintain efficient and scalable software solutions using Golang.Collaborate with cross-functional teams, including product managers, designers, and other developers, to deliver high-quality software.Participate in code reviews to ensure code quality and adherence to best practices.Stay up-to-date with the latest developments in Golang and related technologies to bring new ideas and best practices to the team.Contribute to the entire software development lifecycle, from concept to deployment and maintenance.Requirements:Proven experience developing software applications using Golang.Strong understanding of data structures, algorithms, and software design principles.Experience with web development frameworks and technologies (e.g., Gin, Echo).Familiarity with containerization technologies such as Docker and orchestration tools like Kubernetes.Proficiency in version control systems, especially Git.Benefits:Competitive salaryFlexible work hoursProfessional development opportunitiesVibrant and inclusive company cultureAlthough this role is Fully Remote you must be based in the UK and their is no sponsorship offered for this roleApply for the role or alternative send your CV to simon.miles@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/developer-at-explore-group-3760833536?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=QDbT%2FJ%2B2ID6AXlvm7hHYGQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Developer",
    "description": "Rust DeveloperFully Remote (Anywhere in the UK)Salary: Up to £55,000 per annum Explore Group have partnered with a well established in game advertising company who are looking for an experience Rust Developer to join their global team. Role Overview:Coming into the role you will play a pivotal role in developing a greenfield development project, creating an innovative advertising platform within gaming environments that provide a seamless and engaging experience for both players and advertisers. Responsibilities:Collaborate with cross-functional teams to design, develop, and implement advertising solutions within game environments using Rust.Write clean, efficient, and maintainable code, ensuring high performance and reliability of in-game advertising systems.Contribute to the entire development lifecycle, from concept and design to deployment and maintenance.Work closely with game developers and designers to integrate advertising solutions that complement the gaming experience.Troubleshoot, debug, and optimize existing systems to ensure smooth functionality.Requirements: 2 years + of hands-on experience with Rust programming.Proficiency in collaborating with remote teams using various communication and project management tools.Prior experience with Python is desirable.Strong problem-solving skills and the ability to work independently within a remote environment.Familiarity with different gaming platforms and their unique development requirements.Ability to adapt and learn new technologies quickly.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/technical-team-lead-at-explore-group-3752443282?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=jSjZxsTEdbpZJyAsZwkWAw%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Technical Team Lead",
    "description": "Technical Team Lead-Fully Remote-£80k to £90kWe are currently working with a fantastic client in the prop tech sector who are looking to revolutionise how we buy property. They are looking for a Technical Team Lead who is comfortable in both hands on coding as well as leading the team from a management perspective.Requirements:10+ years experience working in the technology industry with 2+ years as a Tech lead or in a comparable technology leadership roleProficient in TypeScript and JavaScript, specifically Next.js, Nest.js, React Native and AWSCan demonstrate experience leading a team of engineersInterested in all disciplines of web development (devops, back-end, front-end, DBA, UX/UI, QA etc)Can demonstrate how you have taken ownership for your work/teamResponsibilities:Ship code that directly impacts home buyers in Dubai, Paris, Lisbon, Barcelona, and Madrid as they learn, discover, and close on their dream homeLead the technical design and implementation of new features and functionalityBe at the ground floor of our growing engineering team - having influence on the technologies, culture, processes, and product Working in your own squad of engineers overseeing the development and maintenance of the code base and infrastructureAlthough the role is remote you must be based in the UK and there is no sponsorship offeredApply for the role or alternative send your CV to simon.miles@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/software-engineer-at-explore-group-3757690967?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=mvqyd7f%2F2Fbh8O79dOPkig%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Software Engineer",
    "description": "🌟 Join Our Team as a Senior Software Engineer! 🌟Position: Senior Software EngineerExperience: 3+ YearsStart Date: Around November 20th, 2023Contract Duration: 1 Year (with the possibility of extension)Location: Fully Remote (US), Hybrid (Portland or Wilsonville)Are you a seasoned Senior Software Engineer with expertise in C++ and Java? We're seeking an exceptional individual to join our innovative team! Whether you prefer working fully remote anywhere in the US or enjoy a hybrid setup in Portland or Wilsonville, this opportunity is for you.Key Requirements:✅ 3+ years of experience in C++ and Java✅ Familiarity with software development IDEs✅ Agile software development experience✅ Proficiency in Git and Github✅ Experience with REST APIsLocation Details:📍 Ideal Candidates: Based in Portland or Wilsonville🚗 Commute: Willing to commute for key meetingsPosition Details:📅 Start Date: Around November 20th, 2023⏳ Contract Duration: 1 Year (with potential extension)💻 Remote Options: Fully remote (US) or Hybrid (Portland or Wilsonville)💰 Competitive Rate: $60+ per hourResponsibilities:🚀 Design, develop, and maintain software applications🔄 Collaborate in an agile environment to meet project goals🛠 Work with C++ and Java to create efficient and robust solutions🌐 Utilize REST APIs to enhance software functionality🔧 Implement version control using Git and GithubBenefits:🌍 Flexible Work Environment: Choose between fully remote or hybrid options.💼 Career Growth: Opportunities for extension and professional development.💸 Competitive Compensation: Earn a competitive daily rate of $60+ per hour.How to Apply:If you're ready to take on a challenging role as a Senior Software Engineer, apply now! Send your resume to izzy.hibbert@exploreltd.com. Join us in shaping the future of software development! 🚀✨\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/engineering-manager-at-explore-group-3757574767?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=MtuASbHFfEYdyezQpH4Tng%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Engineering Manager",
    "description": "Job Title: Senior Software Engineering ManagerCompany: London-based Scale-up Business in the SaaS SpaceLocation: London, United Kingdom - Remote UKSalary: Circa £105K Explore Group are partnered with a dynamic and rapidly growing scale-up business operating within the SaaS industry. Their cutting-edge technology platform enables businesses to streamline their operations and drive efficiency in a competitive marketplace. With a commitment to innovation and a customer-centric approach, they are revolutionising the way businesses operate.They are seeking an experienced Senior Software Engineering Manager to join their talented team in London. This is a key leadership role within our organisation, responsible for driving engineering efficiency, managing architectural practices, and leading a high-performing software engineering team.Responsibilities:Lead and inspire a team of software engineers, architects, and technical specialists, fostering a culture of collaboration, innovation, and continuous improvement.Drive engineering efficiency by implementing best practices, processes, and tools to streamline development and delivery cycles.Define and implement architectural frameworks and strategies to ensure scalable, robust, and secure software solutions.Collaborate closely with product managers, stakeholders, and cross-functional teams to align on technical requirements, priorities, and roadmaps.Provide technical guidance and mentorship to team members, promoting their professional growth and development.Conduct performance reviews, provide regular feedback, and identify training opportunities to enhance the team's skills and capabilities.Work closely with the senior leadership team to contribute to the overall business strategy and roadmap.Requirements:Significant experience (4+ years) in a senior software engineering management role within the SaaS industry.Proven track record of successfully leading and managing software engineering teams, delivering high-quality software solutions on time and within budget.Strong expertise in engineering efficiency, including implementing best practices, agile methodologies, and continuous delivery processes.In-depth knowledge of architectural principles, patterns, and frameworks, with experience in designing and scaling complex systems.Familiarity with both on-premises and cloud-based solutions (AWS)Comfortable working with: TypeScript, Next.js, Nest.js, React and Node.js Experience with containerisation technologies (Docker, Kubernetes) and microservices architecture.Excellent communication and interpersonal skills, with the ability to effectively collaborate with stakeholders at all levels.Strong leadership qualities, including the ability to motivate and inspire a diverse team, and make data-driven decisions - 2 years experience Apply now! Interviews happening this week!\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/full-stack-engineer-at-explore-group-3760835931?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=1vyupeuQ67mSUGM0%2BRVRzw%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Engineer",
    "description": "Full Stack DeveloperFully Remote (Anywhere in Spain)Salary: Up to €40,000 per annum Explore Group are exclusively working with a global dynamic and innovative consultancy company who are committed in delivering cutting-edge solutions for their well-established clients. They are seeking an experienced Full Stack Developer to join their team and contribute to their projects.Responsibilities:Develop and maintain web applications using Vue.js and Node.Collaborate with cross-functional teams to design, develop, and test software solutions.Write clean, efficient, and maintainable code, following best coding practices and design principles.Troubleshoot and resolve software defects and issues in a timely manner.Optimize application performance and ensure scalability.Participate in code reviews and provide constructive feedback to team members.Stay up-to-date with industry trends and emerging technologies to make recommendations for improvements.Requirements: 4 years + of professional experience in Full Stack Development.Proficiency in Vue.js and NodeKnowledge of RESTful API design and development.Familiarity with version control systems (e.g., Git).Strong problem-solving skills and attention to detail.Excellent communication skills, both written and spoken in English.Applicants based in Europe, would have to relocate to Spain for this role.Relocation package offered.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/data-engineer-at-explore-group-3743466277?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=T%2ByB7D0lWvUYrC3zyYmS%2FQ%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Data Engineer",
    "description": "🚀Data Engineer Opportunity! 🚀 🌟12 Month Contract 🌟NEED TO BE WITH IN THE EU🌟€32 a hour ( 40 hours a week )🌟 🌟 FULLY REMOTE 🌟NEEDS TO SPEAK ENGLISH🌟Are you an experienced Data Engineer looking for a new contract to start ASAP, We have an exciting opportunity for you to join the team. This 12 month contract offers a competitive hourly rate of €32 an hour ( Ruffley €5,700 a month ) , and we're ready for you to start immediately.✅EXPERIENCE IN - SAP BO (BUISNESS OBJECTIVE)✅ EXPERIENCE IN - POWER BI✅ MUST SPEAK ENGLISH FLUENTLY🌟12 Month Contract 🌟NEED TO BE WITH IN THE EU🌟€32 a hour ( 40 hours a week )🌟 🌟 FULLY REMOTE 🌟NEEDS TO SPEAK ENGLISH🌟🌐 What's in It for You:💼 12 Month Rolling Contract: Enjoy the flexibility of a rolling contract, allowing you to focus on challenging your skill set with this long term commitment.💲 Competitive Compensation: Earn a hourly rate of €32 hourly rate ( Ruffley €5,700 a month )you will be working 40 hours a week, as you embrace your role and make a significant impact on our gaming app.🏁 Immediate Start: Jump into action from day one, taking on a pivotal role in our team's success.🌐 Apply now or send your CV to Libby.Ince@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/data-engineer-at-explore-group-3758285394?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=%2FU%2B71JT3lR7UuUDczHJAgQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Data Engineer",
    "description": "Data Engineer (12-Month Contract - Fully Remote)Location: Fully remote - Can be based anywhere in EuropeAre you a talented Data Engineer with a strong background in SAP BusinessObjects (BO) and Power BI? Do you have experience in report requirement engineering and report building? If you're looking for a challenging opportunity that allows you to work remotely from anywhere in Europe, we want to hear from you!As a Data Engineer, you will play a pivotal role in our organization, contributing to data-driven decision-making and enabling the creation of insightful reports. This 12-month remote contract offers you the flexibility to work from the comfort of your chosen location while engaging in impactful projects.Key Responsibilities:Collaborate with stakeholders to gather and understand report requirements.Utilize your expertise in SAP BusinessObjects (BO) and Power BI to design, develop, and maintain reports.Transform complex data into actionable insights, enhancing the decision-making process.Work closely with cross-functional teams to ensure data accuracy and quality.Qualifications:Proven experience as a Data Engineer.Proficiency in SAP BusinessObjects (BO) and Power BI.Strong report requirement engineering and report building skills.Excellent problem-solving and analytical abilities.Self-motivated and able to work independently in a remote setting.Additional Information:12-month contract position with competitive compensation.Fully remote work - Can be based anywhere in Europe.Opportunity to work with cutting-edge data technologies.Collaborative and inclusive team culture.If you're a skilled Data Engineer ready to make a significant impact through your data expertise, we encourage you to apply.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-machine-learning-engineer-at-explore-group-3766517831?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=c3xD30ffFJfP2nJ5noiNcA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Machine Learning Engineer",
    "description": "Role: Machine Learning EngineerLocation: United Kingdom (Fully remote!)Explore Group are excited to be partnering with an exciting company within the Digital Asset space who have a huge emphasis on Machine Learning and Artificial Intelligence. They're looking for TWO Machine Learning Engineers to join them on a permanent basis and revolutionise the way business is done!What you'll be doing:Machine Learning Mastery: Adding 5+ years of expertise to the team, employing typical ML tools to design, implement, and optimise machine learning models.Innovative Solutions: Contribute to the development of cutting-edge solutions that propel them to the forefront of the industry.Collaborative Excellence: Work seamlessly with cross-functional teams, ensuring the integration of machine learning capabilities into their products and services.Continuous Learning: Stay ahead of the curve by staying informed about the latest advancements in machine learning and related technologies.What they're looking for:Expertise: A minimum of 5 years of hands-on experience in Machine Learning, with a proven track record of successful project delivery.Tool Proficiency: Mastery of typical ML tools and frameworks to tackle complex challenges. (TensorFlow, Keras, PyTorch, NumPy, Python, RestAPIs)Collaborative Spirit: Thrive in a remote, yet highly collaborative, work environment, fostering teamwork and effective communication.Innovative Mindset: A passion for staying at the forefront of technological advancements, driving continuous improvement.Interested? Apply or drop me a message here, or via email: reuben.adebambo@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/ml-architect-at-explore-group-3763187470?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=UBBk80daz6sxiOt7wEZZ8A%3D%3D&position=26&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "ML Architect",
    "description": "🚀ML ARCHITECT Opportunity! 🚀🌟6 Month Contract 🌟NEEDS TO BE WITHIN SPAIN, POLAND AND SLOVAKIA🌟 🌟 FULLY REMOTE 🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP Are you an experienced Software Engineer looking for a new contract to start ASAP, We have an exciting opportunity for you to join the team and we're ready for you to start immediately.✅EXPERIENCE IN - ML ( MACHINE LEARNING)✅ EXPERIENCE IN - CLOUD DEVELOPMENT ( AZURE, AWS, GCP ) ✅ EXPERIENCE IN - AI AND MLOPS ( PYTHON, DOCKER, KUBERNETES )🌟6 Month Contract 🌟NEEDS TO BE WITHIN SPAIN, POLAND AND SLOVAKIA🌟 🌟 FULLY REMOTE 🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP WE'RE NOT EXCEPTING ANY SUPPORT FROM EXTERNAL AGENCIES, ANY EMAILS WILL BE TREATED AS SPAM!🌐 What's in It for You:💼 6 Month Rolling Contract: Enjoy the flexibility of a rolling contract, allowing you to focus on challenging your skill set with this long term commitment.💲 Competitive Compensation:you will be working 40 hours a week, as you embrace your role and make a significant impact on our gaming app.🏁 Immediate Start: Jump into action from day one, taking on a pivotal role in our team's success.🌐 Apply now or send your CV to Libby.Ince@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/data-engineer-at-explore-group-3753034409?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=lOE9EB1TmjvgvUoFTjYTaQ%3D%3D&position=27&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Data Engineer",
    "description": "INCREDIBLE CAREER OPPORTUNITY AT ONE OF THE WORLD'S LARGEST INSURANCE ORGANISATIONS WORKING IN THEIR INVESTMENT ACCOUNTING AND ADMINISTRATION DEPARTMENT WITHIN INVESTMENT MANAGEMENT FOR AN EXPERIENCED DATA ENGINEER IN CLOUD-BASED DATABASE DESIGN AND ARCHITECTURE, DATA PIPELINES, PYTHON, SPARK, AND DELTA/DATA LAKE TECHNOLOGY.Those in this position will play a crucial role in designing, developing, improving, and maintaining a sophisticated data hub responsible for overseeing critical business operations. Successful candidates should showcase a strong ability to grasp new concepts rapidly, possess a background in data engineering, and/or demonstrate solid expertise in software engineering.Responsibilities Work with the team to understand platform capabilities and how to best improve and expand those capabilities.Design, development, enhancement, and maintenance of complex data pipeline products which manage business-critical operations and large-scale analytics applications.Support internal Investment Management clients and understand their unique needs and challenges.Instil excellence into the processes, methodologies, standards, and technology choices embraced by the team.Embrace new concepts quickly to keep up with fast-moving data engineering technology.Dedicate time to continuous learning to keep the team appraised of the latest developments in the space.Qualifications3+ years of Data Engineering experience including 2+ years designing and building Databricks data pipelines is required; Azure cloud is highly preferred, however will consider AWS, GCP or other cloud platform experience in lieu.Experience with conceptual, logical and/or physical database designs is a plus2+ years of hands-on Python/Pyspark/SparkSQL and/or Scala experience is required2+ years of experience with Big Data pipelines or DAG Tools (Data Factory, Airflow, dbt, or similar) is required2+ years of Spark experience (especially Databricks Spark and Delta Lake) is required2+ years of hands-on experience implementing Big Data solutions in a cloud ecosystem, including Data/Delta Lakes, is required2+ years of SQL experience, specifically to write complex, highly optimized queries across large volumes of data is highly desiredExperience of R would be a plusExperience with financial data providers such as Bloomberg in an asset management firm or other financial service company is highly desiredMust be comfortable speaking English Perks of the job€400/dayFully Remote!!English Speaking6-12 Month Contract5 Year Project!!Clear path of progression and growth!Expert level team matesAmazing culturePlease contact me on miles.girling@exploreltd.com asap to discuss more!!\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/data-engineer-at-explore-group-3758288170?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=GqwPFKPRkWgCUg1cHIMGJg%3D%3D&position=28&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Data Engineer",
    "description": "Data Engineer - Fully RemoteWe're currently working with a leading agency, who are looking for an experienced Data Engineer to join the team on a freelance basis.Key Responsibilities:SAP BO report landscape inventoryVerify or create the business needs for the required reports.Considering the needs, assist in designing the target MS Power BI report landscape.Support MS Power BI report migration (based on above result)Requirements:At least 3 years commercial experience as a Data EngineerExperience with SAP BO, BO Universes, BO scheduling, BO Administration Report buildingReport requirement engineering The role:Fully remote within EuropeMust have full rights to work in Europe12 month freelance contractQuick interview process with a ASAP startFor more information, apply here or email me at dounia.hardwicke@exploreltd.comData Engineer - Fully Remote\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-machine-learning-engineer-at-explore-group-3766564427?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=VTsQibW83sznFnS4fUWnjQ%3D%3D&position=29&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Machine Learning Engineer",
    "description": "Machine Learning Engineer(Fully remote!)Explore Group are excited to be partnering with an exciting company within the Digital Asset space who have a huge emphasis on Machine Learning and Artificial Intelligence. They're looking for TWO Machine Learning Engineers to join them on a permanent basis and revolutionise the way business is done!What you'll be doing:Machine Learning Mastery: Adding 5+ years of expertise to the team, employing typical ML tools to design, implement, and optimise machine learning models.Innovative Solutions: Contribute to the development of cutting-edge solutions that propel them to the forefront of the industry.Collaborative Excellence: Work seamlessly with cross-functional teams, ensuring the integration of machine learning capabilities into their products and services.Continuous Learning: Stay ahead of the curve by staying informed about the latest advancements in machine learning and related technologies.What they're looking for:Expertise: A minimum of 5 years of hands-on experience in Machine Learning, with a proven track record of successful project delivery.Tool Proficiency: Mastery of typical ML tools and frameworks to tackle complex challenges. (TensorFlow, Keras, PyTorch, NumPy, Python, RestAPIs)Collaborative Spirit: Thrive in a remote, yet highly collaborative, work environment, fostering teamwork and effective communication.Innovative Mindset: A passion for staying at the forefront of technological advancements, driving continuous improvement.Interested? Apply or drop me a message here, or via email: ryan.sollazzo@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/full-stack-developer-at-explore-group-3760196325?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=UeKbnv3yvN0ZZdqMetF2Iw%3D%3D&position=30&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Developer",
    "description": "Full Stack Developer - Remote (Spain) - Up to €40,000Location: Remote (Anywhere in Spain)Job Type: Full-TimeAbout Us:Our client is a global IT services and consulting company, and we're seeking a talented Full Stack Developer to join our team remotely, from anywhere in Spain. We offer an exciting opportunity to be part of our dynamic organization, working with cutting-edge technologies while fostering your professional growth.Key Requirements:Location: Based in Spain or within the European Union, with a willingness to work remotely from any location within Spain. Relocation to Barcelona is ideal, and if required, we offer a relocation bonus.Profile: We are looking for a Full Stack Developer with a proven track record and the ability to work independently and as part of a team.Technologies: Proficiency in Angular, Java, and Spring is essential.Soft Skills: We value team players who are quick learners and are committed to developing their careers.Experience: You should have 3-4 years of experience in Full Stack Development, with a demonstrated ability to contribute effectively to projects.Languages: Excellent command of English is a must, and knowledge of Spanish is a plus.Start Date: Immediate availability is required.If you are interested in this role please apply or send your CV to shems.brangier@exploreltd.com.Full Stack Developer - Remote (Spain) - Up to €40,000\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/software-engineer-at-explore-group-3762199122?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=u4Ed6kuIhZUCY%2Fj%2FDhSkgw%3D%3D&position=31&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Software Engineer",
    "description": "Job Title: Software Developer (BizFlow, Java/JavaScript)Location: Fully Remote (Anywhere in Europe)Contract Duration: 12 MonthsHourly Rate: €30 per hourCompany Overview:Join our dynamic team as a Software Developer with expertise in BizFlow, Java, JavaScript, and Business Process Management (BPM). We're searching for an experienced professional to work on a fully remote basis from anywhere in Europe. If you have over 5 years of experience and are ready to make an immediate impact, we want you on board.Key Responsibilities:Develop and maintain software applications using BizFlow, Java, JavaScript, and BPM.Collaborate with cross-functional teams to gather requirements, deliver solutions, and optimize business processes.Contribute to the full software development lifecycle, from design to deployment.Troubleshoot and resolve software defects and performance issues.Optimize application performance, ensure scalability, and improve business process efficiency.Stay updated with industry best practices and emerging technologies in BPM and software development.Qualifications:5+ years of experience as a Software Developer.Proficiency in BizFlow, Java, JavaScript, and Business Process Management.Strong understanding of web development fundamentals.Experience with the full software development lifecycle.Self-motivated, detail-oriented, and able to work independently.Immediate availability for a 12-month contract.This is a fully remote position, providing the flexibility to work from anywhere in Europe. Please apply below :)\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/c-%2B%2B-developer-at-explore-group-3759929966?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=khCv5MJiYO8pnM0%2B1QKHYQ%3D%3D&position=32&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "C ++ Developer",
    "description": "🌟 Join Our Team - C++ Developer 🌟Location: 🌍 Fully Remote (any European country)Contract Duration: 12 MonthsCompany: A Prestigious Global ConsultancyAre you a C++ wizard with a passion for crafting complex algorithms and working in a dynamic, remote-friendly environment? If so, we have an exciting opportunity for you to join our elite team!About Us:🌐 We're a global consultancy with a footprint across Europe, bringing innovation and cutting-edge solutions to clients worldwide.Key Responsibilities:🔸 Develop and implement complex algorithms in C++🔸 Strong expertise in object-oriented programming🔸 Proficiency in analytical geometry🔸 Experience with MS Visual Studio and Git🔸 Working knowledge of the CAD domain🔸 Familiarity with OpenGL and GLSL🔸 Cross-platform development on Windows, Linux, iOS, or AndroidRequirements:✅ 5+ years of C++ development experience✅ Passion for creating elegant and efficient solutions✅ Enthusiasm for collaboration and problem-solving✅ Ability to work independently in a remote setupWhy Choose Us?🚀 Cutting-edge Projects: Join us in solving intricate challenges in the CAD domain.💼 Global Consultancy: Work with a worldwide network of experts.🏡 Fully Remote: Enjoy the freedom to work from your preferred location in Europe.If you're ready to take your C++ skills to the next level and embark on an exciting journey with a global consultancy, apply now!If you are interested please send your CV to izzy.hibbert@exploreltd.com or apply below💫Don't miss this chance to shape the future of technology! 🚀✨\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-python-developer-contract-at-explore-group-3759598158?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=ripk%2BdabF2yvCwE25ssY9A%3D%3D&position=33&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Python Developer - Contract",
    "description": "Senior Python Developer Contract - ASAP Start ⬇️Are you a seasoned Python Developer with a passion for crafting cutting-edge solutions in the financial services realm? Explore are partnered with a global FS firm seeking an immediate contractor to join their team for a 12 month project.🚀 What You Bring to the Table:✅ Extensive experience with Django framework✅ AWS wizardry at your fingertips✅ Proven track record in the financial services industry💡 Why Us?🌍 Fully Remote within the UK 📆 Secure a 12-month contract with the potential for extension💸 Up to £500 per day, outside IR35⚠️Must have the right to work in the UK.📈 Contribute to ground breaking projects and shape the future of financial technology. If you're ready to code your way to success, apply now and be part of our dynamic, global team! 💻✨Apply directly or contact me for more information at max.murray@exploreltd.com.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/graph-database-developer-at-explore-group-3758949182?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=AKX49dVBNFUONquRHNHS3g%3D%3D&position=34&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Graph Database Developer",
    "description": "🚀GRAPH DATABASE DEVELOPER Opportunity! 🚀🌟12 Month Contract 🌟NEEDS TO BE WITHIN US🌟🌟 FULLY REMOTE 🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP Are you an experienced Graph Database developer looking for a new contract to start ASAP, We have an exciting opportunity for you to join the team and we're ready for you to start immediately.✅EXPERIENCE IN - GRAPH DATABASE EXPERIENCE ( E.G NEO4J OR MONGO DB)✅ EXPERIENCE IN - ETL AND ELT ✅ EXPERIENCE IN - SQL🌟12 Month Contract 🌟NEEDS TO BE WITHIN US🌟🌟 FULLY REMOTE 🌟STARTING ASAP🌟NOT OFFERING A SPONSERSHIP WE'RE NOT EXCEPTING ANY SUPPORT FROM EXTERNAL AGENCIES, ANY EMAILS WILL BE TREATED AS SPAM!🌐 What's in It for You:💼 12 Month Rolling Contract: Enjoy the flexibility of a rolling contract, allowing you to focus on challenging your skill set with this long term commitment.💲 Competitive Compensation:you will be working 40 hours a week, as you embrace your role and make a significant impact on our gaming app.🏁 Immediate Start: Jump into action from day one, taking on a pivotal role in our team's success.🌐 Apply now or send your CV to Libby.Ince@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-software-engineer-at-explore-group-3758406311?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=wVqv4BCOIEl4f1eKc8t%2FVQ%3D%3D&position=35&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Software Engineer",
    "description": "Senior Software Engineer (Node.js) Salary: £75,000+ Location: Nottingham - Hybrid (Once a month in Nottingham) We have partnered up with a well-funded global supply chain company with over 100,000 traders in Europe! This role offers the opportunity to work on exciting projects in a dynamic industry. They're looking for a Node.js Developer who is comfortable with Node.js and Typescript as they grow their engineering team on both the Frontend and Backend!Responsibilities:Very comfortable using Node.jsMicroservices architecture experienceExperience in performing code reviews and helping to maintain best practicesIn-depth understanding of the entire web development processBuilding responsive and scalable interfacesBonus experience working with Typescript and React (Bonus)A team player but can manage independent tasks within a timely mannerSkills/ExperienceJavaScriptNodeSQLAzureReactIdeally, you will have at least 4+ years' experience as a Senior Software Engineer, with knowledge of Node.js. You will be part of a team responsible for developing interfaces efficiently and working closely with other developers to ensure the smooth running of projects.Interviews are actively taking place this week - Apply now!Note: This opportunity cannot provide sponsorship\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/technical-lead-at-explore-group-3755240738?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=iqrX33rfyPTths68FkBGIQ%3D%3D&position=36&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Technical Lead",
    "description": "Technical Lead (Remote, Spain)Location: Spain (Fully Remote)Salary: €350 per dayAre you a seasoned technical professional with a passion for leadership and a wealth of experience in cloud platforms, automation, DevOps, AI, APIs, and microservices? Do you thrive in mentoring and guiding technical teams to success? If so, we have an exciting opportunity for you!Job Description:As a Technical Lead, you will play a pivotal role in guiding and mentoring our technical teams to deliver cutting-edge solutions using cloud platforms, automation, DevOps, AI, APIs, and microservices. This role offers a fully remote working environment in Spain and provides a competitive daily rate of €350.Key Responsibilities:Technical Leadership: Lead and mentor technical teams to successfully design, develop, and deliver innovative solutions.Cloud Expertise: Utilize your proficiency in cloud platforms to architect, build, and manage scalable and secure cloud-based solutions.Automation and DevOps: Drive automation and DevOps best practices to improve development, testing, and deployment processes.Technology Proficiency: Apply your broad technical experience in AIs, APIs, and microservices to design and implement robust and efficient solutions.Collaboration: Collaborate effectively with cross-functional teams to ensure successful project delivery and alignment with business goals.Proven experience in leading and mentoring technical teams.Proficiency in cloud platforms, such as AWS, Azure, or GCP.Strong knowledge of automation and DevOps practices.Broad technology expertise in AIs, APIs, and microservices.Self-motivated, results-oriented, and able to work independently in a remote setting.Excellent communication and problem-solving skills.Fluent in English and Spanish.If you are a dynamic technical leader who is ready to make a significant impact in a remote work environment, we encourage you to apply for this role.\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/full-stack-engineer-at-explore-group-3760191183?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=6bwECcEvi3OP6fTixbV9Hw%3D%3D&position=37&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Full Stack Engineer",
    "description": "Full Stack Developer Fully Remote (Anywhere in Spain)Salary: Up to €40,000 per annum Explore Group are exclusively working with a global dynamic and innovative consultancy company who are committed in delivering cutting-edge solutions for their well-established clients. They are seeking an experienced Full Stack Developer to join their team and contribute to their projects. Responsibilities:Develop and maintain web applications using Java, Angular, and Spring frameworks.Collaborate with cross-functional teams to design, develop, and test software solutions.Write clean, efficient, and maintainable code, following best coding practices and design principles.Troubleshoot and resolve software defects and issues in a timely manner.Optimize application performance and ensure scalability.Participate in code reviews and provide constructive feedback to team members.Stay up-to-date with industry trends and emerging technologies to make recommendations for improvements.Requirements: 4 years + of professional experience in Full Stack Development.Proficiency in Java, Angular, and Spring frameworks.Knowledge of RESTful API design and development.Familiarity with version control systems (e.g., Git).Strong problem-solving skills and attention to detail.Excellent communication skills, both written and spoken in English.\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-data-engineer-at-explore-group-3752449666?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=xnT6sXlW5slZlCA7mc657w%3D%3D&position=38&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Data Engineer",
    "description": "Role: Senior Data Platform EngineerLocation: LondonJob DescriptionWe're searching for a Data Platform Engineer to head up the data engineering and algorithm development in our clients top sports performance platform. In this position, you'll be in charge of a team of skilled data engineers who build data pipelines to support a large user base. Your job involves creating and implementing machine learning and big data algorithms using the latest serverless technology. We're looking for someone with leadership experience and a strong educational background.The ideal candidate is a hands-on leader who can guide diverse teams in a high-performance work setting. You'll closely collaborate with their Data Science, Product, and Design teams, serving as a bridge between engineering and cross-functional leadership.Key Responsibilities:Take full responsibility for data operations engineering and execution.Provide hands-on guidance and technical leadership to your team, including:Deploying machine learning algorithms in their Python-based data pipelines.Working with data scientists to put their models into action.Creating data models, validation tests, and database queries to support data integration and app development.Managing tasks from technical design to technical client support.Manage expectations with their internal teams and adapt quickly in a fast-paced environment that relies heavily on AWS.Requirements:Proficiency in Python 3Familiarity with Python libraries for data, like Pandas and NumpyExperience with AWSKnowledge of different database types, including NoSQL databasesSkills in improving performanceProven experience delivering complex softwareFamiliarity with CI/CD tools, such as Gitlab, Github, Jenkins, Circle, etc.Experience with serverless deploymentsExposure to data science frameworks like MatLab and SageMakerCollaborative and mentoring abilitiesReach out to me: reuben.adebambo@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/logic-apps-specialist-at-explore-group-3762611917?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=283VHh1Ea8eQbm%2FKkK%2F0Iw%3D%3D&position=39&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Logic Apps Specialist",
    "description": "We are looking for an experienced Logic Apps Specialist to work with one of the Leading International Insurance Organisations.This client of mine are looking for a Logic Apps Specialist on an initial 6 month freelance contract that is guaranteed to be extended. The project is expected to last up to 4 years.Please see key details below, and share your contact number so we can discuss asap.Description:Sharepoint strong knowledgeDevelop Azure Logic Apps workflows to automate data pipelines between Looker (BI) and other systems.Create Logic Apps workflows to trigger.Develop Logic Apps workflows to embed Looker dashboards and reports into other applications for enhanced accessibility.Troubleshoot and debug Logic Apps workflows to ensure seamless and error-free execution.Provide technical support to users of Logic Apps and Looker, addressing queries and issues promptly.English requiredPlease share your contact number and CV and let me know when is good for us to discuss further.Best regards,\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/site-reliability-engineer-at-explore-group-3759096875?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=9y79soQ9BDGXhZnCHNVBcA%3D%3D&position=40&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Site Reliability Engineer",
    "description": "I am currently partnered with a leading LegalTech business based in London who are looking for a Site Reliability Engineer to join their team on a permanent basis.My client are a leader in their field and are revolutionising the way the Legal sector uses technology.Key Responsibilities:Design, implement, and maintain highly available and scalable AWS infrastructure.Monitor and proactively address performance and availability issues, ensuring optimal system performance.Develop and maintain automation tools for deployment, monitoring, and maintenance tasks.Collaborate closely with development and operations teams to implement best practices for code deployment and infrastructure management.Implement and maintain security measures to safeguard sensitive data and ensure compliance with industry standards.Conduct regular system audits to identify areas for improvement and optimization.Provide support and troubleshooting for production issues and participate in an on-call rotation.Tech Stack:AWSCI/CD pipelines Observability TerraformMySQL/Aurora This is a remote opportunity.If this would be of interest please send your CV to charlie.nagel@exploreltd.com or apply!\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/graph-database-engineer-at-explore-group-3764161991?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=WqfydeR6cgezdBmo84KfTg%3D%3D&position=41&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Graph Database Engineer",
    "description": "Graph Database Engineer 🚀Location: Fully Remote (US based)Contract Type: 12-month contract ⏳Hourly Rate: $60-65 per hour 💸We are a dynamic and forward-thinking organization at the forefront of innovative data solutions. Our team is committed to leveraging cutting-edge technologies to optimize data management and drive meaningful insightsRole Overview:We are seeking a skilled Graph Database Engineer with a focus on graph databases, particularly Neo4j, to join our remote team. The ideal candidate will have a strong background in working with multiple databases, emphasizing graph databases, and document databases such as MongoDB. As a Graph Database Engineer, you will be responsible for creating robust data models, designing efficient queries, and leveraging ETL and ELT processes to ensure seamless data integration.Key Responsibilities:Design and implement efficient data models, with a strong emphasis on graph databases, particularly Neo4j.Work with various databases, including document databases (e.g., MongoDB), and utilize ETL and ELT processes for data integration.Develop and optimize queries for performance and scalability.Collaborate with cross-functional teams to integrate data from different sources.Utilize both relational and NoSQL scripts for data manipulation and extraction.Have hands-on experience with API integration for seamless data flow.Qualifications and Skills:Proven experience as a Database Engineer with a strong emphasis on graph databases (Neo4j).Familiarity with document databases, such as MongoDB.Proficient in ETL and ELT processes for efficient data integration.Experience with both relational and NoSQL scripts for data manipulation.Strong understanding of API integration for smooth data flow.Contract Details:12-month contract.Fully remote position, with flexibility for candidates in any US location.Competitive hourly rate of $60-65.We are looking to fill this position urgently, with interview slots available this week. If you are a skilled Graph Database Engineer with a passion for cutting-edge data solutions, please send your resume and a brief cover letter to izzy.hibbert@exploreltd.com Deadline for Applications:Apply as soon as possible to secure an interview slot.Join us in shaping the future of data management! 🌐🔍\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/mean-stack-developer-at-explore-group-3752435283?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=0Z4Vg1dbQOAh%2B1ibwdnzyQ%3D%3D&position=42&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Mean stack developer",
    "description": "🚀 MEAN Stack Developer Wanted!  ⭐FULLY REMOTE⭐COMPETITIVE SALARY⭐12MNTH CONTRACT⭐Are you an experienced MEAN Stack Developer with a passion for creating cutting-edge solutions? Join our global digital business services firm and take your career to new heights!🌐 Who We Are:We are a global digital business services firm, leading the way in innovation and technology solutions. We're seeking a skilled MEAN Stack Developer to be part of our dynamic team.🛠️ What We Need:4+ years of CONSISTENT experience using the full MEAN stack: MongoDB, Express, Angular, and Node.A well-rounded developer, not just focused on front-end or back-end.Strong English skills.Located in Europe, working fully remote.👨‍💻 What You'll Do:Develop and maintain web applications using MongoDB, Express, Angular, and Node.Be an integral part of a global team working on exciting projects.Help shape the future of digital business services.🔥 What We Offer:A competitive salary.Fully remote work, with the flexibility to be based anywhere in Europe.A fast, 1/2 stage interview process.📩 Ready to Join Us?If you're a MEAN Stack Developer who's ready to make an impact in a global digital business services firm, we want to hear from you! Send your resume to max.murray@exploreltd.com and be part of our innovative team.Don't miss this opportunity to take your MEAN Stack expertise to the next level. Apply today! 🚀\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/cloud-backend-engineer-at-explore-group-3760876640?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=jScGW2wWs7rybKs%2F5ax3CQ%3D%3D&position=43&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Cloud Backend Engineer",
    "description": "🌟6 MONTH CONTRACT ROLLING🌟FULLY REMOTE🌟ITALIAN SPEAKINGAre you a Cloud Backend Engineer looking for a brand-new contract role? we're currently partnered with a leading consultancy who are starting an exciting project, who are looking for a Cloud Backend Engineer to come and join the team on an exciting new Contract role.✅STRONG EXPERIENCE WITH AWS CLOUD ✅ Proficiency in REST API, GRAPH QL, NODE, TYPESCRIPT.🌟6 MONTH CONTRACT ROLLING🌟FULLY REMOTE🌟ITALIAN SPEAKING🌐 What's in It for You:💼 6-month contract rolling💲Flexible day rate 🏁 Interviews ASAP!🌐 Apply now or send your CV to Liberty.dunne@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/mean-stack-developer-at-explore-group-3753036550?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=Gyfo4L0YlWw4JukkrJDzFQ%3D%3D&position=44&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Mean stack developer",
    "description": "🌟12 MONTH FREELANCE CONTRACT🌟FULLY REOMTE🌟Are you a Mean Stack Developer looking for a brand-new contract role? we're currently partnered with a leading consultancy who are starting an exciting project, who are looking for an Mean stack Developer to come and join the team on an exciting new Contract freelance role.✅EXPERIENCE WITH MEAN (MONGODB, EXPRESS.JS,ANGULAR,NODE.JS)✅ENGLISH SPEAKING 🌟12 MONTH FREELANCE CONTRACT🌟FULLY REOMTE🌟🌐 What's in It for You:💼 12 month freelance role💲Flexible Hourly Rate🏁 Interviews ASAP! 🌐 Apply now or send your CV to Liberty.dunne@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://www.linkedin.com/jobs/view/senior-automation-tester-at-explore-group-3759943465?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=EzTlOsyYQzjWyuDRgq11YA%3D%3D&position=45&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Automation Tester",
    "description": "🌐 Join Our Team! Senior Automation Tester Wanted! 🌐Are you a skilled Automation Tester looking for your next challenge? We're seeking a Senior Automation Tester with expertise in Cypress and Node.js to join our dynamic team in the EU!Key Requirements:🚀 Proficient in Cypress and Node.js🌍 EU-based and fluent in English💼 Senior-level experience in automation testing💰 Competitive rates: Up to €450 daily📅 Short contract with potential for extension🔍 SAP experience (preferred, but not necessary)If you're passionate about pushing the boundaries of automation testing and thrive in a collaborative environment, we want to hear from you! Don't miss this opportunity to be part of an exciting project with room for growth.Send your CV and a brief cover letter to max.murray@exploreltd.com to kickstart your next adventure in testing excellence! 🚀 #AutomationTester #JobOpportunity #TechInEU\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://es.linkedin.com/jobs/view/azure-logic-apps-specialist-at-explore-group-3762630646?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=B%2F7VjkR%2F11lJMiFSAr6j9A%3D%3D&position=46&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Azure Logic Apps Specialist",
    "description": "INCREDIBLE CAREER OPPORTUNITY AT ONE OF THE WORLD'S LARGEST INSURANCE ORGANISATIONS FOR AN EXPERIENCED LOGIC APPS SPECIALIST! Strong knowledge with SharepointDevelop Azure Logic Apps workflows to automate data pipelines between Looker (BI) and other systems.Create Logic Apps workflows to trigger.Develop Logic Apps workflows to embed Looker dashboards and reports into other applications for enhanced accessibility.Troubleshoot and debug Logic Apps workflows to ensure seamless and error-free execution.Provide technical support to users of Logic Apps and Looker, addressing queries and issues promptly. Perks of the job€350/dayFully Remote!!English required6-12 Month ContractMulti-Year Project!!!Clear path of progression and growth!Expert level teammates to upskill your experience and gain knowledge fromFriendly and collaborative culturePlease contact me on miles.girling@exploreltd.com asap to discuss more!!\n      \n\n        \n\n    \n    \n    \n\n    \n        Mostrar más\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Mostrar menos"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/golang-developer-at-explore-group-3760876736?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=oeKqskrH%2BVvcJ%2FQw3U53wQ%3D%3D&position=47&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Golang Developer",
    "description": "We are currently seeking a skilled Golang Developer to join our team on a contract basis. This exciting opportunity allows you to work fully remote, contributing your expertise to meaningful projects.Position Overview:As a Golang Developer, you will play a pivotal role in our software development process. We are looking for an experienced individual with a strong command of Golang, capable of delivering high-quality solutions within a remote work setting.Responsibilities:Develop scalable and efficient software solutions using Golang.Collaborate with cross-functional teams to gather and understand project requirements.Write clean, maintainable code following industry best practices.Conduct thorough code reviews and provide constructive feedback.Debug and optimize code for performance and scalability.Qualifications:Proven experience as a Golang Developer.Strong proficiency in Golang and relevant frameworks.Experience with microservices architecture.Familiarity with containerization tools such as Docker.Solid understanding of software development best practices.Requirements:Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent experience).Previous experience working in remote environments.Immediate availability to start the contract.Strong portfolio or examples of past Golang projects.\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/scala-developer-at-explore-group-3762196481?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=ERvMcd3tmTgO%2FH5tzBX4%2Fg%3D%3D&position=48&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Scala Developer",
    "description": "Scala Developer-Fully Remote-£50k to £70k DOEMy client are revolutionising the music tech industry and are currently looking for a Scala Developer to join their expanding team at a key point in the journey of scaling up.Responsibilities:- Design, develop, and maintain scalable and high-performance backend systems using Scala.- Collaborate with cross-functional teams to define, design, and ship new features.- Implement best practices in software development, ensuring code quality, and participating in code reviews.- Work closely with product managers, architects, and other stakeholders to understand requirements and translate them into robust, scalable, and maintainable solutions.Requirements:- At least 4+ years experience as a Scala Developer or in a similar role.- Strong proficiency in Scala and functional programming principles.- Experience with Akka, Play Framework, and other Scala frameworks.- Solid understanding of distributed systems and microservices architecture.- Familiarity with relational and NoSQL databases.- Experience with build tools such as SBT.Benefits:- Competitive salary and performance-based bonuses.- Flexible work hours and remote work options.- Professional development opportunities.- Collaborative and innovative work environment.If you're passionate about Scala development and want to be part of a forward-thinking team, we'd love to hear from you!Although this role is Fully Remote you must be based in the UK and their is no sponsorship offered for this roleApply for the role or alternative send your CV to simon.miles@exploreltd.com\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  },
  {
    "url": "https://uk.linkedin.com/jobs/view/senior-scala-engineer-at-explore-group-3757265492?refId=sxZR6w35YwQGdVVO3898bw%3D%3D&trackingId=%2BxaRI0C5XjHM%2BUZeImB4gg%3D%3D&position=49&pageNum=0&trk=public_jobs_jserp-result_search-card",
    "company": "Explore Group",
    "title": "Senior Scala Engineer",
    "description": "Are you a seasoned Senior Scala Engineer looking for your next exciting contract opportunity? We are seeking a highly skilled individual to join our team and contribute to cutting-edge projects.Role and Responsibilities:As a Senior Scala Engineer, you will:Develop and maintain high-quality, scalable, and efficient software solutions using Scala.Collaborate with cross-functional teams to design and implement complex features and systems.Participate in code reviews, mentor junior developers, and ensure adherence to best coding practices.Identify and address performance bottlenecks, technical debt, and architectural improvements.Troubleshoot and resolve complex technical issues, ensuring system stability and reliability.Qualifications:Proven track record as a Senior Scala Engineer, demonstrating expertise in functional programming.Strong proficiency in Scala, Akka, Play, and related technologies.Experience with microservices architecture, containerization (e.g., Docker), and cloud platforms (e.g., AWS, Azure, GCP).Proficiency in database systems (SQL and NoSQL) and data modelling.Exceptional problem-solving skills and the ability to work both independently and collaboratively.Excellent communication skills and a collaborative mindset.Contact Details:Contract Duration: Flexible (Specify contract duration)Rate: £450 - £550 per day (Outside IR35)Location: RemoteStart Date: Immediate\n      \n\n        \n\n    \n    \n    \n\n    \n        Show more\n\n        \n    \n  \n\n        \n\n    \n    \n    \n\n    \n        Show less"
  }
]